package Lev12;
/*
Свобода печати
Написать пять методов print с разными параметрами.


Требования:
1. Программа не должна выводить текст на экран.
2. Класс Solution должен содержать шесть методов.
3. Класс Solution должен содержать статический метод main().
4. Класс Solution должен содержать пять статических методов print() с разными параметрами.
 */
public class Task1208done {
  public static void main(String[] args) {

  }
  static void print(int a){
    System.out.println(a);
  }

  static void print(String a){
    System.out.println(a);
  }

  static void print(double a){
    System.out.println(a);
  }

  static void print(char a){
    System.out.println(a);
  }

  static void print(long a){
    System.out.println(a);
  }
}
