package Lev8;

import java.util.Set;

/*
Создать множество строк (Set<String>), занести в него 20 слов на букву "Л".


Требования:
1. Программа не должна выводить текст на экран.
2. Программа не должна считывать значения с клавиатуры.
3. Класс Solution должен содержать только два метода.
4. Метод createSet() должен создавать и возвращать множество (реализация HashSet).
5. Множество из метода createSet() должно содержать 20 слов на букву «Л».
 */
public class Task0813 {
  public static Set<String> createSet() {
    //напишите тут ваш код

  }

  public static void main(String[] args) {

  }
}
