package Lev8;

import java.io.IOException;

/*
Программа вводит с клавиатуры имя месяца и выводит его номер на экран в виде: "May is 5 month".
Используйте коллекции.


Требования:
1. Программа должна считывать одно значение с клавиатуры.
2. Программа должна выводить текст на экран.
3. Программа должна использовать коллекции.
4. Программа должна считывать с клавиатуры имя месяца и выводить его номер на экран по заданному шаблону.
 */
public class Task0828 {
  public static void main(String[] args) throws IOException {
    //напишите тут ваш код
  }
}
